---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpaceCarpetingParam
source: html/1b26e9f8-64d3-91a1-5296-4addc9516f9e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpaceCarpetingParam Property

"Carpeting"

## Syntax (C#)
```csharp
public static ForgeTypeId SpaceCarpetingParam { get; }
```